# Tips Database

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
tips = sns.load_dataset('tips')

## Date : 5/15/2020      
Topics Covered till today: Series , Data Frames(loc,iloc,st,iat,where)

#### Q1: Display first 10 rows with total_bill , tip and day.

In [3]:
tips[['total_bill','tip','day']].head(10)

   total_bill   tip  day
0       16.99  1.01  Sun
1       10.34  1.66  Sun
2       21.01  3.50  Sun
3       23.68  3.31  Sun
4       24.59  3.61  Sun
5       25.29  4.71  Sun
6        8.77  2.00  Sun
7       26.88  3.12  Sun
8       15.04  1.96  Sun
9       14.78  3.23  Sun

#### Q2.Display transactions related to lunch.

In [4]:
tips[tips['time'] == "Lunch"]

     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
78        22.76  3.00    Male     No  Thur  Lunch     2
79        17.29  2.71    Male     No  Thur  Lunch     2
80        19.44  3.00    Male    Yes  Thur  Lunch     2
81        16.66  3.40    Male     No  Thur  Lunch     2
..          ...   ...     ...    ...   ...    ...   ...
222        8.58  1.92    Male    Yes   Fri  Lunch     1
223       15.98  3.00  Female     No   Fri  Lunch     3
224       13.42  1.58    Male    Yes   Fri  Lunch     2
225       16.27  2.50  Female    Yes   Fri  Lunch     2
226       10.09  2.00  Female    Yes   Fri  Lunch     2

[68 rows x 7 columns]

#### Q3.Display the summary information for total_bill and tip.

In [6]:
tips[['total_bill','tip']].describe()

       total_bill         tip
count  244.000000  244.000000
mean    19.785943    2.998279
std      8.902412    1.383638
min      3.070000    1.000000
25%     13.347500    2.000000
50%     17.795000    2.900000
75%     24.127500    3.562500
max     50.810000   10.000000

#### Q4.Display average tip amount for male customers.

In [25]:
tips.loc[tips.sex == 'Male','tip'].mean()

3.0896178343949052

#### Q5.Display transactions where table size is 2,4 or 6.

In [34]:
tips[(tips['size']==2) | (tips['size']==4) | (tips['size']==6)]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
6          8.77  2.00    Male     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
237       32.83  1.17    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[197 rows x 7 columns]

#### Q6.Display first 3 columns for first 10 rows.

In [35]:
tips.iloc[:10,:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female
5       25.29  4.71    Male
6        8.77  2.00    Male
7       26.88  3.12    Male
8       15.04  1.96    Male
9       14.78  3.23    Male

#### Q7.Display Count of transactions for each day.

In [36]:
tips.day.value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

## Date: 5/16/2020   
Topics Covered till today :DataFrames (apply,applymap,str attribute,add rows, add columns,delete rows,delete columns,reshaping data.

#### Q1.Display transactions where a day starts with 'S'.

In [37]:
tips[tips.day.str.startswith('S')]

     total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[163 rows x 7 columns]

#### Q2.Display total_bill amount and tip amount.

In [17]:
tips[['total_bill','tip']].sum()

total_bill    4827.77
tip            731.58
dtype: float64

#### Q3.Display the size of the table as small or large(small = 3 or less than 3, large = all others).

In [18]:
tips['size'].apply(lambda v : 'large' if v>3 else 'small')

0      small
1      small
2      small
3      small
4      large
       ...
239    small
240    small
241    small
242    small
243    small
Name: size, Length: 244, dtype: object

## Date:5/18/2020
Topics covered till today:Concatenation , Grouping data.

### Q1.Display total_bill amount for each day.

In [38]:
tips.groupby('day')['total_bill'].sum()

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

### Q2.Display total tip amount for each day and smokers.

In [20]:
tips.groupby(['day','smoker'])['tip'].sum()

day   smoker
Thur  Yes        51.51
      No        120.32
Fri   Yes        40.71
      No         11.25
Sat   Yes       120.77
      No        139.63
Sun   Yes        66.82
      No        180.57
Name: tip, dtype: float64

### Q3.Display total_bill and tip grouped by size.

In [39]:
tips.groupby(['size'])[['total_bill','tip']].sum()

      total_bill     tip
size
1          28.97    5.75
2        2565.89  402.84
3         884.55  128.94
4        1058.70  153.01
5         150.34   20.14
6         139.32   20.90

### Q4.Average tip amount for each day for female.

In [22]:
tips.groupby(['sex'])['tip'].mean()

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

### Q5.Maximum total bill for each day and each time.

In [23]:
tips.groupby(['day','time'])['total_bill'].max()

day   time
Thur  Lunch     43.11
      Dinner    18.78
Fri   Lunch     16.27
      Dinner    40.17
Sat   Lunch       NaN
      Dinner    50.81
Sun   Lunch       NaN
      Dinner    48.17
Name: total_bill, dtype: float64

## Date:5/19/2020 
Topics Covered till today: Deal with missing data,Write DataFrame , Pivot table, Read and Write from database.

#### Q1.Display the total_bill for each day for each male and female.

In [24]:
tips.groupby(['sex','day'])['total_bill'].sum()

sex     day
Male    Thur     561.44
        Fri      198.57
        Sat     1227.35
        Sun     1269.46
Female  Thur     534.89
        Fri      127.31
        Sat      551.05
        Sun      357.70
Name: total_bill, dtype: float64

#### Q2.Find out percentage of tip amount to total_bill amount.

In [54]:
tip_per = tips.tip / tips.total_bill * 100
tip_per.name = 'tip_per'

In [58]:
# Display total_bill, tip and tip_per
pd.merge(tips[['total_bill','tip']], tip_per,left_index=True, right_index=True)

     total_bill   tip    tip_per
0         16.99  1.01   5.944673
1         10.34  1.66  16.054159
2         21.01  3.50  16.658734
3         23.68  3.31  13.978041
4         24.59  3.61  14.680765
..          ...   ...        ...
239       29.03  5.92  20.392697
240       27.18  2.00   7.358352
241       22.67  2.00   8.822232
242       17.82  1.75   9.820426
243       18.78  3.00  15.974441

[244 rows x 3 columns]